In [1]:
import pandas as pd
df = pd.read_excel('lab 2-3\JOB_INFO.xlsx')
df
#đếm số tuổi có trong danh sách
demtuoi = df['Age'].count()
demtuoi

44

In [13]:
#tìm tuổi lớn nhất
tuoilonnhat = df['Age'].max()
tuoilonnhat

39.0

In [14]:
#tìm tuổi nhỏ nhất
tuoinhonhat = df['Age'].min()
tuoinhonhat

22.0

In [15]:
#tính tuổi trung bình
tuoiTB = df['Age'].mean()
tuoiTB

28.977272727272727

In [16]:
#tính độ chênh lệch
dochenhlech = df['Age'].std()
dochenhlech

4.406594616020015

In [17]:
#tìm tuổi xuất hiện nhiều nhất
xuathiennhieulan = df['Age'].mode()
xuathiennhieulan

0    28.0
Name: Age, dtype: float64

In [4]:
#tính tổng hợp
df.describe()

             Age  WorkingYear       Salary  TrainedYear
count  44.000000    45.000000    46.000000    43.000000
mean   28.977273     4.133333  1143.847826     3.976744
std     4.406595     1.739906   238.132360     1.318158
min    22.000000     1.000000   766.000000     2.000000
25%    26.750000     3.000000   894.250000     3.000000
50%    28.500000     4.000000  1216.500000     4.000000
75%    31.000000     5.000000  1347.250000     5.000000
max    39.000000     7.000000  1457.000000     7.000000

In [3]:
#thống kê gọp nhóm
df.groupby('Skill')[['Age','Salary']].describe()

        Age                                                     Salary  \
      count       mean       std   min   25%   50%    75%   max  count
Skill
C#     12.0  31.250000  4.287932  23.0  28.0  31.0  33.00  38.0   13.0
Java    6.0  32.000000  4.774935  28.0  28.5  30.0  35.25  39.0    6.0
R      13.0  26.384615  2.534379  22.0  24.0  27.0  28.00  29.0   13.0
SQL    13.0  28.076923  4.348592  22.0  25.0  29.0  31.00  34.0   14.0


              mean         std     min      25%     50%     75%     max
Skill
C#     1130.923077  203.078992   766.0   943.00  1189.0  1258.0  1386.0
Java   1375.833333  104.618195  1228.0  1296.75  1432.0  1449.5  1456.0
R      1055.692308  244.024720   813.0   894.00   912.0  1219.0  1457.0
SQL    1138.285714  257.366075   767.0   843.50  1245.0  1335.5  1453.0

In [5]:
#đo sự tương quan
df[['Salary','WorkingYear']].corr()

               Salary  WorkingYear
Salary       1.000000     0.566201
WorkingYear  0.566201     1.000000

In [6]:
#đo sự tương quan
df[['Salary','Age']].corr()

          Salary       Age
Salary  1.000000  0.428102
Age     0.428102  1.000000

In [7]:
#đo sự tương quan
df[['Salary','TrainedYear']].corr()

               Salary  TrainedYear
Salary       1.000000     0.910077
TrainedYear  0.910077     1.000000

In [8]:
#đo sự tương quan
df[['WorkingYear','Age']].corr()

             WorkingYear       Age
WorkingYear     1.000000  0.787217
Age             0.787217  1.000000